{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"LSTM","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM1","trainable":true,"batch_input_shape":[null,3,1],"dtype":"float32"}},{"class_name":"LSTM","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM2","trainable":true}}],"keras_version":"tfjs-layers 0.6.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["my-model.weights.bin"],"weights":[{"name":"lstm_LSTM1/kernel","shape":[1,12],"dtype":"float32"},{"name":"lstm_LSTM1/recurrent_kernel","shape":[3,12],"dtype":"float32"},{"name":"lstm_LSTM1/bias","shape":[12],"dtype":"float32"},{"name":"lstm_LSTM2/kernel","shape":[3,4],"dtype":"float32"},{"name":"lstm_LSTM2/recurrent_kernel","shape":[1,4],"dtype":"float32"},{"name":"lstm_LSTM2/bias","shape":[4],"dtype":"float32"}]}]}